app/Controllers/Admin.php

    public function reset_password_juko()
    {
        $nomor_anggota = $this->request->getVar('nomor_anggota');
        $reset = [
            'nomor_anggota' => $nomor_anggota,
            'password' => password_hash('bravokopma', PASSWORD_DEFAULT),
        ];

        if (!$this->akun->save($reset)) {
---
UPDATE `akun` SET `nomor_anggota` = '0000/Kopma_Ul/00', `password` = '$2y$10$d0ps4nmZQCxXOc/EHSc/XOhGFgDVbmCADEGZ8ZTIOP5/08en0oc66', `updated_at` = '2025-09-18 13:42:02'
WHERE `akun`.`nomor_anggota` IN ('0000/Kopma_Ul/00')