app/Controllers/Humas.php

SELECT *
FROM `alumni`
---
    public function alumni()
    {
        $search = $this->request->getVar('search');

        if ($search) {
            $alumni = $this->alumniModel->like('nama_alumni', $search)->orLike('email_alumni', $search)->orLike('no_hp_alumni', $search)->orLike('alamat_alumni', $search)->orLike('status_alumni', $search)->orLike('tahun_lulus', $search)->paginate(50, 'alumni');
        } else {
            $alumni = $this->alumniModel->findAll();

UPDATE `alumni` SET `nama_alumni` = 'ROYAN au', `nomor_anggota` = '1998', `npm` = '2215061029', `jurusan` = 'Manajemen', `fakultas` = 'FEB', `jabatan` = 'Kabid Humas', `alamat_alumni` = 'GUNTER', `email_alumni` = 'ryON@gmail.com', `no_hp_alumni` = '099999', `tahun_lulus` = '2020', `status_alumni` = 'Demisioner', `updated_at` = '2025-09-18 13:54:29'
WHERE `alumni`.`id_alumni` IN ('193')
---
            return redirect()->to('/humas/edit_alumni')->withInput();
        }

        if (!$this->alumniModel->save($input)) {