app/Controllers/Psda.php

    public function data_anggota()
    {
        //select all data with chunk
        $search = $this->request->getVar('search');
        if ($search) {
            $anggota = $this->data_anggota
                ->like('data_anggota.npm', $search)->orLike('data_anggota.nama_lengkap', $search)
                ->orLike('data_anggota.nomor_anggota', $search)
                ->paginate(50, 'data_anggota');
        } else {
            $anggota = $this->data_anggota->findAll();
---
SELECT *
FROM `data_anggota`
WHERE `data_anggota`.`deleted_at` IS NULL

    public function edit_anggota()
    {
        $nomor_anggota = $this->request->getVar('nomor_anggota');
        $data = [
            'title' => 'Edit Data Anggota',
            'anggota' => $this->data_anggota->where('nomor_anggota', $nomor_anggota)->first(),
---
SELECT *
FROM `data_anggota`
WHERE `nomor_anggota` = '1593/Kopma_Ul/18'
AND `data_anggota`.`deleted_at` IS NULL
 LIMIT 1

    public function update_anggota()
    {

        if (!$this->data_anggota->save([
            'npm' => $this->request->getVar('npm'),
            'nomor_anggota' => $this->request->getVar('nomor_anggota'),
            'nama_lengkap' => $this->request->getVar('nama'),
            'email' => $this->request->getVar('email'),
            'nomor_hp' => $this->request->getVar('no_handphone'),
            'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
            'keanggotaan' => $this->request->getVar('keanggotaan'),
            'jurusan' => $this->request->getVar('jurusan'),
            'fakultas' => $this->request->getVar('fakultas'),
        ])) {
            session()->setFlashdata('error', 'Data gagal diudpate');
            return redirect()->to('/psda/data_anggota');
        }

        // 🚀 tambahan pindah ke alumni kalau status Alumni/Demisioner
        $status = $this->request->getVar('keanggotaan');
        if ($status === 'Alumni' || $status === 'Demisioner') {
            $this->alumniModel->insert([
                'npm'           => $this->request->getVar('npm'),
                'nomor_anggota' => $this->request->getVar('nomor_anggota'),
                'nama_alumni'  => $this->request->getVar('nama'),
                'email_alumni'   => $this->request->getVar('email'),
                'no_hp_alumni'   => $this->request->getVar('no_handphone'),
                'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
                'jurusan'       => $this->request->getVar('jurusan'),
                'fakultas'      => $this->request->getVar('fakultas'),
                'status_alumni'        => $status,
                'slug_alumni'   => url_title($this->request->getVar('nama'), '-', true),
            ]);

            // optional: hapus dari data_anggota
            $this->data_anggota
                ->where('nomor_anggota', $this->request->getVar('nomor_anggota'))
                ->delete();
---
UPDATE `data_anggota` SET `npm` = '', `nomor_anggota` = '1594/Kopma_Ul/18', `nama_lengkap` = 'Desvita Adaria', `email` = '', `nomor_hp` = '0', `jenis_kelamin` = '', `keanggotaan` = 'Alumni', `jurusan` = ' Akuntansi', `fakultas` = 'FEB', `updated_at` = '2025-09-18 13:48:42'
WHERE `data_anggota`.`nomor_anggota` IN ('1594/Kopma_Ul/18')
INSERT INTO `alumni` (`npm`, `nomor_anggota`, `nama_alumni`, `email_alumni`, `no_hp_alumni`, `jenis_kelamin`, `jurusan`, `fakultas`, `status_alumni`, `slug_alumni`, `created_at`, `updated_at`) VALUES ('', '1594/Kopma_Ul/18', 'Desvita Adaria', '', '0', '', ' Akuntansi', 'FEB', 'Alumni', 'desvita-adaria', '2025-09-18 13:48:42', '2025-09-18 13:48:42')
UPDATE `data_anggota` SET `deleted_at` = '2025-09-18 13:48:42', `updated_at` = '2025-09-18 13:48:42'
WHERE `nomor_anggota` = '1594/Kopma_Ul/18'
AND `deleted_at` IS NULL