app/Models/AlumniModel.php

SELECT *
FROM `alumni`
WHERE `slug_alumni` = 'royan'
 LIMIT 1
---
    public function getAlumni($slug = false)
    {
        if (!$slug) {
            return $this->findAll();
        }

        return $this->where(['slug_alumni' => $slug])->first();